lvx/base/DataProcessors/бит_РабочееМестоКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_РабочееМестоКазначея</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикАнализ</Name>
					<Comment>Компоновщик анализ</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияПериодов</Name>
					<Comment>Режим отображения периодов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияСчетов</Name>
					<Comment>Режим отображения счетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйДень</Name>
					<Comment>Оперативный день</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Comment>Режим сообщений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньРаскрытияСчетов</Name>
					<Comment>Уровень раскрытия дерева счетов по-умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьПредельныеСрокиПлатежа</Name>
					<Comment>Выделять предельные сроки платежа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьПлатежныеПоручения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Информация</Name>
					<Comment>Цвет информационных строк</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Прошлое</Name>
					<Comment>Цвет прошлое</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Настоящее</Name>
					<Comment>Цвет настоящее</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Будущее</Name>
					<Comment>Цвет будущее</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Запрет</Name>
					<Comment>Цвет запрет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Выходной</Name>
					<Comment>Цвет выходной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаПанелиТекущийДокумент</Name>
					<Comment>Высота панели "Текущий документ"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОстаткиПоНеоплаченнымЗаявкам</Name>
					<Comment>Выводить остатки по неоплаченным заявкам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПрогнозыПлатежей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ПериодичностьРМК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьВыходныеДни</Name>
					<Comment>Выделять выходные дни</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыМинимум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыМаксимум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыСреднее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_РежимОтображенияОстатковДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиРасчетыЧерезБанк</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗаписиДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиРасчетыЧерезКассу</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗаписиДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСчета</Name>
							<Comment>Вид счета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_кзн_ПланируемыйРасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемыйРасходДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_кзн_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемоеПоступлениеДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/DataProcessors/бит_РабочееМестоКазначея/Forms/ФормаРазбиенияПозиции/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ДокументПланирования) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
							  |en = 'This form cannot be opened directly.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ВалютаПлатежа 		 = Параметры.ВалютаПлатежа;
	ДокументПланирования = Параметры.ДокументПланирования;
	
	ТипДокументаПланирования = ТипЗнч(ДокументПланирования);
	Если ТипДокументаПланирования = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
	 ИЛИ ТипДокументаПланирования = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПланируемыйРасходДенежныхСредств.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(,
		|		&УсловиеНаДокумент) КАК ПланируемыйРасходДенежныхСредств";
		
		ЧтоЗаменить = "&УсловиеНаДокумент";
		Если ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
			НаЧтоЗаменить = "Позиция = &Документ";
		Иначе	
			НаЧтоЗаменить = "ДокументПланирования = &Документ";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить,НаЧтоЗаменить);
	Иначе	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПланируемоеПоступлениеДенежныхСредств.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Остатки(,
		|		&УсловиеНаДокумент) КАК ПланируемоеПоступлениеДенежныхСредств";
		
		ЧтоЗаменить = "&УсловиеНаДокумент";
		Если ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления") Тогда
			НаЧтоЗаменить = "Позиция = &Документ";
		Иначе	
			НаЧтоЗаменить = "ДокументПланирования = &Документ";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить,НаЧтоЗаменить);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Документ", ДокументПланирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	ОсталосьЗаплатить = 0;
	Если Выборка.Следующий() Тогда
		ОсталосьЗаплатить = Выборка.Сумма;
	КонецЕсли;
	
	ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПланирования, "ВалютаДокумента");
	
	Если ВалютаПлатежа <> ВалютаДокумента Тогда
		СуммаКОплате = Параметры.СуммаПлатежа;
		Сумма 		 = ПересчитатьСуммыКОплате(СуммаКОплате, ВалютаПлатежа, ВалютаДокумента);
	Иначе
		Элементы.ГруппаСуммаОплаты.Видимость = Ложь;
		Сумма = Параметры.СуммаПлатежа;
	КонецЕсли; 
	
	НадписьОсталосьЗаплатить = НСтр("ru='Доступно: %1';en='Available: %1'"); 
	НадписьОсталосьЗаплатить = СтрШаблон(НадписьОсталосьЗаплатить, 
								РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОсталосьЗаплатить, ВалютаДокумента));
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если СуммаЗаполненаКорректно() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Команда", 		  "ОК");
		Результат.Вставить("Сумма", 		  Сумма);
		Результат.Вставить("ВалютаПлатежа",   ВалютаПлатежа);
		Результат.Вставить("СуммаДокумента" , ОсталосьЗаплатить);
		
		Закрыть(Результат);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКОплатеПриИзменении(Элемент)
	
	Сумма = ПересчитатьСуммыКОплате(СуммаКОплате, ВалютаПлатежа, ВалютаДокумента);
	
	СуммаЗаполненаКорректно();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)

	Если СуммаЗаполненаКорректно() Тогда
		СуммаКОплате = ПересчитатьСуммыКОплате(Сумма, ВалютаДокумента, ВалютаПлатежа);
	Иначе
		Сумма = ОсталосьЗаплатить;
	КонецЕсли;
	
КонецПроцедуры

//  Процедура пересчитывает суммы к оплате. 
//
&НаСервере
Функция ПересчитатьСуммыКОплате(Сумма, ВалютаНач, ВалютаКон)

	НачальныйКурс = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаНач, ТекущаяДатаСеанса());
	КонечныйКурс  = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаКон, ТекущаяДатаСеанса());
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Сумма, НачальныйКурс, КонечныйКурс);
	
КонецФункции // ПересчитатьСуммыКОплате()

&НаКлиенте
Функция СуммаЗаполненаКорректно()

	Отказ = Ложь;
	Если Сумма > ОсталосьЗаплатить Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность",
							НСтр("ru='Сумма';en='Amount'"),,, НадписьОсталосьЗаплатить);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Сумма",, Отказ); 
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции
